-- phpMyAdmin SQL Dump
-- version 5.1.1deb5ubuntu1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Авг 05 2024 г., 09:31
-- Версия сервера: 8.0.35-0ubuntu0.22.04.1
-- Версия PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `sqltask`
--

-- --------------------------------------------------------

--
-- Структура таблицы `brands`
--

CREATE TABLE `brands` (
  `brand_id` int NOT NULL,
  `name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `brands`
--

INSERT INTO `brands` (`brand_id`, `name`) VALUES
(7, 'DAEWOO'),
(2, 'PowerMan'),
(5, 'SMARTWATT'),
(8, 'Uniel'),
(4, 'Вольт ENGINEERING'),
(1, 'Ресанта'),
(3, 'Энергия'),
(6, 'ЭРА');

-- --------------------------------------------------------

--
-- Структура таблицы `stabilizers`
--

CREATE TABLE `stabilizers` (
  `id` int NOT NULL,
  `brand` int NOT NULL,
  `price` decimal(8,2) NOT NULL,
  `power` decimal(8,2) NOT NULL,
  `weight` decimal(8,1) DEFAULT NULL,
  `model` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `stabilizers`
--

INSERT INTO `stabilizers` (`id`, `brand`, `price`, `power`, `weight`, `model`) VALUES
(1, 1, '18399.00', '10.00', '16.2', 'АСН-10000Н/1-Ц'),
(2, 1, '6299.00', '2.00', '4.2', 'С2000'),
(3, 1, '4299.00', '2.00', '5.7', 'АСН-2000/1-Ц'),
(4, 1, '339999.00', '80.00', '273.0', 'АСН-80000/3-ЭМ'),
(5, 1, '2799.00', '0.50', '2.5', 'АСН-500/1-Ц'),
(6, 1, '4799.00', '1.00', '3.7', 'АСН-1000 Н2/1-Ц'),
(7, 1, '11999.00', '5.40', '9.4', 'СПН-5400'),
(8, 1, '99999.00', '20.00', '78.4', 'АСН-20000/3'),
(9, 1, '56799.00', '15.00', '75.0', 'АСН-15000/3-Ц'),
(10, 1, '14899.00', '6.40', '16.9', 'АСН- 8000 Н/1-Ц Lux'),
(11, 2, '2250.00', '0.28', '1.6', 'AVS 500 C'),
(12, 2, '3199.00', '0.50', '2.3', 'AVS 1000C'),
(13, 2, '4699.00', '0.25', '2.2', 'AVS 500Р'),
(14, 2, '6799.00', '1.50', '4.0', 'AVS 1500D'),
(15, 2, '7699.00', '1.50', '3.6', 'AVS 1500P'),
(16, 2, '32499.00', '15.00', '23.6', 'AVS 15000D'),
(17, 2, '27499.00', '8.00', '14.1', 'AVS 8000P'),
(18, 2, '13999.00', '5.00', '8.3', 'AVS 5000P'),
(19, 2, '10999.00', '5.00', '9.3', 'AVS 5000S'),
(20, 2, '8999.00', '3.00', '7.2', 'AVS 3000S'),
(21, 3, '633999.00', '100.00', '309.0', 'Hybrid II 100000/3'),
(22, 3, '278999.00', '45.00', '250.0', 'Hybrid II 45000/3'),
(23, 3, '16299.00', '5.00', '11.0', 'Voltron 5000'),
(24, 3, '71299.00', '12.00', '26.5', 'Classic 12000'),
(25, 3, '29799.00', '10.00', '17.6', 'Voltron 10000'),
(26, 3, '60499.00', '7.20', '24.0', 'Ultra 9000'),
(27, 3, '7099.00', '1.00', '3.1', 'APC-1000'),
(28, 3, '5899.00', '0.50', '2.6', 'APC-500'),
(29, 3, '19899.00', '10.00', '14.9', 'АСН-10000'),
(30, 3, '3099.00', '0.50', '2.4', 'АСН-500'),
(31, 3, '103999.00', '12.00', '54.3', 'Hybrid II 15000/3'),
(32, 4, '63799.00', '14.00', '26.0', 'Ампер Э 9-1/63 v2.1'),
(33, 4, '59999.00', '11.00', '26.0', 'Ампер Э 12-1/50 v2.1'),
(34, 4, '37999.00', '7.00', '21.0', 'Ампер Э 9-1/32 v2.1'),
(35, 4, '94999.00', '14.00', '30.0', 'Герц Э 36-1/63 v3.0'),
(36, 4, '77999.00', '18.00', '30.0', 'Ампер Э 9-1/80 v2.1'),
(37, 4, '104499.00', '18.00', '30.0', 'Герц Э 36-1/80 v3.0'),
(38, 5, '21599.00', '12.00', '18.8', 'AVR TOWER 12000RF'),
(39, 5, '17199.00', '8.00', '13.0', 'AVR SLIM 8000RW'),
(40, 5, '2650.00', '0.50', '2.2', 'AVR TOWER 500RF'),
(41, 5, '4099.00', '1.50', '3.9', 'AVR TOWER 1500RF'),
(42, 5, '6999.00', '2.00', '4.9', 'BOILER 2000RW'),
(43, 5, '9999.00', '5.00', '9.2', 'AVR TOWER 5000RF'),
(44, 5, '2899.00', '0.50', '1.9', 'AVR HOME 500RU'),
(45, 6, '25899.00', '10.00', '17.2', 'СННТ-10000-Ц'),
(46, 6, '2050.00', '0.30', '1.3', 'СНК-300'),
(47, 6, '11699.00', '5.00', '9.0', 'СННТ-5000-Ц'),
(48, 6, '8599.00', '5.00', '9.5', 'СНПТ-5000-Ц'),
(49, 6, '3999.00', '1.50', '3.2', 'CНК-1500-УЦ'),
(50, 7, '32999.00', '10.00', '24.1', 'DW-TM12kVA'),
(51, 7, '19999.00', '5.00', '16.3', 'DW-TM5kVA'),
(52, 7, '4999.00', '1.00', '3.3', 'DW-TM1kVA'),
(53, 7, '4399.00', '0.50', '2.9', 'DW-TZM500VA'),
(54, 8, '15699.00', '8.00', '17.0', 'RS-1/8000'),
(55, 8, '5099.00', '1.50', '4.9', 'RS-1/1500'),
(56, 8, '11199.00', '4.00', '14.2', 'RS-1/5000'),
(57, 8, '3099.00', '0.30', '1.5', 'U-RST-500/1');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`brand_id`),
  ADD UNIQUE KEY `brands_unique` (`name`);

--
-- Индексы таблицы `stabilizers`
--
ALTER TABLE `stabilizers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `stabilizers_unique` (`model`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `brands`
--
ALTER TABLE `brands`
  MODIFY `brand_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `stabilizers`
--
ALTER TABLE `stabilizers`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
